
public class Main {
    public static void main(String[] args) {
        /*
        Задача 1
Есть две переменные целого типа. Написать программу, выводящую на экран сумму их значений,
а в том в случае, если эти числа равны, должна выводиться сумма умноженная на два.
Пример: 1 + 2 = 3
3 + 2 = 5
2 + 2 = 8
         */
        int num1 = 4;
        int num2 = 4;
        if(num1 == num2){
            System.out.println(( num1 + num2) * 2);
       } else {
           System.out.println( num1 + num2);
       }


        }
        }




