import java.util.Scanner;

public class Main {
    public static void main(String[] args) {
        /*Task 2
        Написать программу, выводящую на экран ASCII значение символа.
        Пример: 'А' результат - 65*/
        System.out.println( "Введите символ ");
        int k;
        char sym='X';
        k=(int)sym;
        System.out.println(sym + "   результат  - "+ k);
    }
}
