public class Main {
    public static void main(String[] args) {
        /*
        Написать программу, выводящую на экран результат деления двух чисел 25 и 3.
        Результат не должен быть округлен до целых. Посчитать также остаток от деления этих чисел.
         */
        double result = 25/3D;
        System.out.println("25/3 = " + result);
        int remainder = 25%3;
        System.out.println("remainder 25/3 is " + remainder);
        /*
        Написать программу, выводящую на экран значение переменной типа инт в квадрате.
        Предварительно обьявите эту переменную и задайте ее значение.( Возведение в квадрат равносильно умножению числа на себя)
        */
        int x;
        x = 5;
        System.out.println("result x^2 is " + x*x);



    }
}
