public class Main {
    public static void main(String[] args){

        /*
        Написать программу, выводящую на экран результат деления двух чисел 25 и 3.
        Результат не должен быть округлен до целых. Посчитать также остаток от деления этих чисел.
         */

        double x = 25;
        double y = 3;
        double result = x / y;
        System.out.println(result);

        /*
        Написать программу, выводящую на экран значение переменной типа инт в квадрате.
        Предварительно обьявите эту переменную и задайте ее значение.
        ( Возведение в квадрат равносильно умножению числа на себя)
         */
        int e = 7;
        int e2 = 2;
        System.out.println(Math.pow(e, e2));

    }
}
