public class Main {
    public static void main(String[] args) {
    double a,b,c, restA;

    b=25;
    c=3;
        a = b/c;

        restA = b%c;

     System.out.println("Result of divide is " + a);

        System.out.println(restA);



        int a1,a2;

            a1 = 16;
            a2 = a1 * a1;

        System.out.println(a2);


//Задача 1.
//Написать программу, выводящую на экран результат деления двух чисел 25 и 3.
// Результат не должен быть округлен до целых.
// Посчитать также остаток от деления этих чисел.
//
//Задача 2.
//Написать программу, выводящую на экран значение переменной типа инт в квадрате.
// Предварительно обьявите эту переменную и задайте ее значение.
//( Возведение в квадрат равносильно умножению числа на себя)



      }

}
