public class Main_1 {
    public static void main(String[] args) {
        int[] array = {1, 2, 8, 7};

        System.out.println("Print even number");
        for (int i = 0; i < array.length; i++) {

            if (i % 2 == 0) {

                System.out.println(array[i]);
            }
        }

        }

        }



/*
Задача2
Есть массив целых чисел. Написать метод, находящий и возвращающий количество
четных чисел в этом массиве. Пример: {1, 2, 8, 7} -> количество четных чисел = 2.
 */

