public class Concat {
    public static void main(String[] args) {
    String strOne = "Hello";
    String strTwo = "There";
    String result = strOne.concat(strTwo);

    System.out.println(result.toUpperCase());
    }
}

/*
Задача 2
Написать метод, принимающий две строки и возвращающий эти строки,
соединенные вместе и в верхнем регистре.
Пример: "Hello", "There" -> HELLOTHERE

 */
