public class String_length {
    public static void main(String[] args) {
        String str = new String("Hello");
        System.out.println(str.length());
    }


}

/*
Задача 1
Написать метод, принимающий строку и возвращающий целое число, равное длине строки
Пример: Hello -> 5

 */
