public class String_length {
    public static void main(String[] args) {
        String java = "Hello";
        System.out.println(java.length());
    }


}

/*
Задача 1
Написать метод, принимающий строку и возвращающий целое число, равное длине строки
Пример: Hello -> 5

 */
