public class Main {
    public static void main(String[] args) {
       /*
       Task 1
Написать программу, которая принимает с клавиатуры имя , фамилию и возраст
(Ваши или воображаемого персонажа) и выводит в консоль эту информацию в следующем виде:

First name: Bill
Last name: Brown
Age: 25

Task 2
Написать программу, выводящую на экран ASCII значение символа.
Пример: 'А' результат - 65
        */
        byte b1;
        char ch;

       b1 = 65; // ASCII for A
        ch =(char) b1;
        System.out.println("ch = " + ch);
    }
}
